---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.PreDocEventArgs
source: html/543d1650-eeb7-d842-2b4a-50ef16fb1874.htm
---
# PreDocEventArgs Properties

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.